src/BusinessProcesses/ОтключениеРасширения/ОтключениеРасширения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:BusinessProcess>
  <name>ОтключениеРасширения</name>
  <task>Task.ЗадачаИсполнителя</task>
  <attributes>
    <name>ЗадачаМетеор</name>
    <type>
      <types>CatalogRef.ЗадачиМетеор</types>
    </type>
  </attributes>
  <attributes>
    <name>Согласовано</name>
    <comment>Результат согласования</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗамечаниеHTML_ОтключениеРасширения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗамечаниехзВложения_ОтключениеРасширения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Разработчик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:BusinessProcess>

src/InformationRegisters/СледующиеЭтапыЗадачиПоТочкеМаршрута/СледующиеЭтапыЗадачиПоТочкеМаршрута.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СледующиеЭтапыЗадачиПоТочкеМаршрута</name>
  <dimensions>
    <name>ТочкаМаршрута</name>
    <type>
      <types>BusinessProcessRoutePointRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Согласовано</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Этап</name>
    <type>
      <types>CatalogRef.ЭтапыЗадачиМетеор</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ЗадачиМетеорДополнений/ЗадачиМетеорДополнений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗадачиМетеорДополнений</name>
  <resources>
    <name>ЗадачаМетеор</name>
    <type>
      <types>CatalogRef.ЗадачиМетеор</types>
    </type>
  </resources>
  <dimensions>
    <name>ВерсияДополнения</name>
    <type>
      <types>CatalogRef.ВерсииДополнений</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ВерсииДополненийПоЗадачеИБазе/ВерсииДополненийПоЗадачеИБазе.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВерсииДополненийПоЗадачеИБазе</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ВерсияДополнения</name>
    <type>
      <types>CatalogRef.ВерсииДополнений</types>
    </type>
  </resources>
  <attributes>
    <name>АвторИзменений</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЗадачаМетеор</name>
    <type>
      <types>CatalogRef.ЗадачиМетеор</types>
    </type>
  </dimensions>
  <dimensions>
    <name>База</name>
    <type>
      <types>CatalogRef.Базы1С</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/ТипыДополнений/ТипыДополнений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыДополнений</name>
  <enumValues>
    <name>ДополнительныйОтчетИлиОбработка</name>
  </enumValues>
  <enumValues>
    <name>Расширение</name>
  </enumValues>
</mdclass:Enum>

src/BusinessProcesses/ОтключениеРасширения/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытийКартыМаршрута

Процедура ПеревестиНаСледующийЭтапПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	
	Если Не ИнтеграцияСМетеор.ПроверитьТекущийЭтапЗадачиВМетеоре(ЗадачаМетеор, Справочники.ЭтапыЗадачиМетеор.ОтключениеРасширения) Тогда
		Возврат;
	КонецЕсли;
	
	Этапы = РегистрыСведений.СледующиеЭтапыЗадачиПоТочкеМаршрута.ПолучитьЭтапыПоТочкеМаршрута(
		Бизнеспроцессы.ОтключениеРасширения.ТочкиМаршрута.ПеревестиНаСледующийЭтап,
		Согласовано);
	
	ИнтеграцияСМетеор.ПеревестиЗадачуНаЭтапВМетеоре(ЗадачаМетеор, Этапы);
	
КонецПроцедуры

Процедура ОтключитьРасширениеПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	
	УстановитьПривилегированныйРежим(Истина);
	МаксимальнаяДлительностьПопыток = 300;
	Если (ТекущаяДатаСеанса() - Дата) > МаксимальнаяДлительностьПопыток Тогда
		Согласовано = Ложь;
		Возврат;
	КонецЕсли;
	
	Отказ = Ложь;
	СообщенияОВыполнении = Новый Массив;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВерсииДополнений.Ссылка КАК ВерсияДополнения,
		|	ВерсииДополненийПоЗадачеИБазеСрезПоследних.База КАК База,
		|	ВерсииДополнений.Наименование КАК ВерсияДополненияПредставление,
		|	ПРЕДСТАВЛЕНИЕ(ВерсииДополненийПоЗадачеИБазеСрезПоследних.База) КАК БазаПредставление,
		|	ВерсииДополнений.ИмяОбъекта КАК Имя
		|ИЗ
		|	РегистрСведений.ЗадачиМетеорДополнений КАК ЗадачиМетеорДополнений
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВерсииДополнений КАК ВерсииДополнений
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ВерсииДополненийПоЗадачеИБазе.СрезПоследних(, ЗадачаМетеор = &ЗадачаМетеор) КАК ВерсииДополненийПоЗадачеИБазеСрезПоследних
		|			ПО ВерсииДополнений.Ссылка = ВерсииДополненийПоЗадачеИБазеСрезПоследних.ВерсияДополнения
		|				И (ВерсииДополненийПоЗадачеИБазеСрезПоследних.ЗадачаМетеор = &ЗадачаМетеор)
		|		ПО ЗадачиМетеорДополнений.ВерсияДополнения = ВерсииДополнений.Ссылка
		|ГДЕ
		|	ЗадачиМетеорДополнений.ЗадачаМетеор = &ЗадачаМетеор";
	
	Запрос.УстановитьПараметр("ЗадачаМетеор", ЗадачаМетеор);
	Выборка = Запрос.Выполнить().Выбрать();
	Попытка
		ПараметрыУдаления = Новый Структура("Имя");
		Пока Выборка.Следующий() Цикл
			ПараметрыУдаления.Имя = Выборка.Имя;
			РаботаСДополнениями.УдалитьДополнение(Выборка.База, Перечисления.ТипыДополнений.Расширение, ПараметрыУдаления);
			СообщенияОВыполнении.Добавить(СтрШаблон("Отключено %1 в базе %2", Выборка.ВерсияДополненияПредставление, Выборка.БазаПредставление));
		КонецЦикла;
		Согласовано = Истина;
		Записать();
	Исключение
		СообщенияОВыполнении.Добавить(СтрШаблон("При выполнении операции с расширениями: %1, возникли ошибки: %2", ЭтотОбъект, ОписаниеОшибки()));
		Отказ = Истина;
	КонецПопытки;
	
	Базы = Новый Массив();
	Выборка.Сбросить();
	Пока Выборка.Следующий() Цикл
		Базы.Добавить(Выборка.База);
	КонецЦикла;
	СостояниеДополненийВБазах = РаботаСДополнениями.ПолучитьСостояниеДополнений(Перечисления.ТипыДополнений.Расширение, Базы);
	ОтборБазаРасширение = Новый Структура("База, Имя", Неопределено, Неопределено);
	Выборка.Сбросить();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ОтборБазаРасширение, Выборка);
		УстановленныеРасширения = СостояниеДополненийВБазах.НайтиСтроки(ОтборБазаРасширение);
		Если УстановленныеРасширения.Количество() Тогда
			СообщенияОВыполнении.Добавить(СтрШаблон(
				"Ошибка: После отключения расширения %1 в базу %2 - обнаружено подключенное активное расширение. (при отключении не было исключений)",
				Выборка.ВерсияДополненияПредставление,
				Выборка.БазаПредставление));
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;	
	
	ТекстМетеор = СтрСоединить(СообщенияОВыполнении, Символы.ПС);
	ИнтеграцияСМетеор.ОтправитьФорматированныйКомментарийВМетеор(ЗадачаМетеор, ТекстМетеор);
	Если Отказ Тогда
		ВызватьИсключение ТекстМетеор;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийМодуля

#КонецОбласти

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
